{"_id":{"$oid":"5f5a30263eb26d8688a6ebcc"},"recipe_name":"POMEGRANATE LAMB SALAD","difficulty_level":"Easy","prep_time":"15min","cooking_description":"1. Heat a non-stick frying pan over high heat. Tip the grains into a bowl and break up with your hands. Transfer to the pan and stir-fry for a minute to warm them. Add 2 tbsp of water and continue to stir-fry for another 30 seconds until the grains begin to puff up and soften. Transfer to a mixing bowl to cool.\r\n\r\n2. Heat half the oil in the same frying pan over a high heat. Season the steaks with salt and fry for 1 ½-2 minutes each side until golden. Turn off the heat and add 2 tbsp of the pomegranate molasses. Use tongs to turn the steaks in the molasses to coat, then transfer to a warm plate. Add 1 tbsp water to the pan, swirl it around, then pour the juices over the steaks. Don’t scrape the pan as it will make the steaks taste bitter. Set the steaks aside to rest for 3 minutes.\r\n\r\n3. Meanwhile, whisk the remaining olive oil, remaining pomegranate molasses and the lemon juice with a good pinch of salt.\r\n\r\n4. Add the mint, pomegranate seeds, carrot, onion, and tomatoes into the bowl with the grains. Pour over the dressing and mix well. Transfer to a serving dish.\r\n\r\n5. Slice the steaks and arrange them over the salad. Spoon over the resting juices and garnish with the pistachios. Grab a fork and tuck in!","picture_url":"https://www.deliciousmagazine.co.uk/wp-content/uploads/2020/09/960x1200-lamb-salad-final-768x960.jpg","ingrediants":"250g pack cooked mixed grains,\r\n2 tbsp olive oil,\r\n2 Welsh lamb steaks (roughly 110g each),\r\n4 tbsp pomegranate molasses,\r\nJuice ½ lemon,\r\nHandful mint leaves- finely chopped,\r\n30g pomegranate seeds,\r\n1 carrot - grated,\r\n½ red onion - finely chopped,\r\n80g cherry tomatoes halved,\r\n10g pistachios - roughly chopped","category":"Red Meat","date":"2020-09-10 13:54:46.533614"}
{"_id":{"$oid":"5f5a31bb3eb26d8688a6ebcd"},"recipe_name":"THE ULTIMATE CREAMY CHICKEN KORMA","difficulty_level":"Easy","prep_time":"30min","cooking_description":"         1. Heat the oil in a non-stick frying pan, add the shallots and fry for 3-4 minutes to brown. Add half the spring onions and fry for 1-2 minutes more.\r\n\r\n2. Stir in the chicken, korma paste, mango chutney and most of the chopped tomatoes. Fry for a few minutes, then add 125ml freshly boiled water. Simmer for 10 minutes until the chicken is cooked through.\r\n\r\n3. Stir in the cream, then taste, adding a little lemon juice to sharpen the flavour. In a bowl, mix the remaining tomatoes, spring onion, coriander, more lemon juice, salt, and pepper.\r\n\r\n4. Serve the curry with a lemon wedge, steamed rice, and poppadums (if you like), with the fresh tomato salad scattered on top.\r\n                ","picture_url":"https://www.deliciousmagazine.co.uk/wp-content/uploads/2019/11/01.Delicious-Jul-Aug-issue-curry-for-one-1-drops-768x960.jpg","ingrediants":"2 tsp vegetable or olive oil,\r\n2 banana shallots - quartered lengthways,\r\n2 spring onions- sliced,\r\n1 small British free-range skinless chicken breast cut into bite-size chunks,\r\n1 tbsp korma curry paste,\r\n2 tsp mango chutney,\r\n2 large vine tomatoes chopped,\r\n1 tbsp clotted or double cream,\r\nSqueeze lemon juice - plus a lemon wedge to serve,\r\n1-2 fresh coriander sprigs - chopped to serve, \r\nSteamed rice and poppadums (optional) to serve","category":"Poultry","date":"2020-09-10 14:25:47.953460"}
{"_id":{"$oid":"5f5a32bd3eb26d8688a6ebce"},"recipe_name":"SEAFOOD SALAD WITH AVOCADO CUCUMBER","difficulty_level":"Easy","prep_time":"10min","cooking_description":"1. Tip the seafood salad into a large bowl. Add the salad leaves, avocado, cucumber, red chilli, and a handful of croutons.\r\n\r\n2. Drizzle over your favorite vinaigrette dressing and gently toss together. Serve with lime wedges, to squeeze over, if you like.","picture_url":"https://www.deliciousmagazine.co.uk/wp-content/uploads/2018/08/316087-1-eng-GB_3697.jpg","ingrediants":"2 x 160g tubs marinated seafood salad,\r\n50g seasonal salad leaves,\r\n1 ripe avocado - peeled - stoned and diced,\r\n100g cucumber - deseeded and diced\r\n1 small red chilli - halved - deseeded and diced,\r\nA handful of ready-made croutons,\r\nVinaigrette dressing of your choice,\r\nLime wedges","category":"Sea Food","date":"2020-09-10 14:05:49.005498"}
{"_id":{"$oid":"5f5a33d03eb26d8688a6ebcf"},"recipe_name":"SINGAPORE PORK AND PRAWN NOODLES","difficulty_level":"Easy","prep_time":"15min","cooking_description":"1. Heat the oil in a large heavy-based frying pan or wok over a high heat. Fry the mince for 2 minutes, stirring, to brown.\r\n2. Turn the heat down to medium-high, add the spices and stir-fry for 3 minutes, then add the prawns, carrots and chillies. Cook for 3 more minutes, then add the noodles, pak choi and 2 tbsp water.\r\n3. Stir-fry, scraping the bottom of the pan to loosen any crispy bits, for another 1-2 minutes until the prawns and mince are cooked through, the vegetables are just tender and the noodles are heated through. Serve straightaway sprinkled with the spring onions and soy sauce.","picture_url":"https://www.deliciousmagazine.co.uk/wp-content/uploads/2018/10/pork-noodles-768x960.jpg","ingrediants":"2 tsp light olive oil,\r\n300g free-range pork mince,\r\n¾ tsp chinese five-spice powder, \r\n2½ tsp curry powder, \r\n180g sustainable raw king prawns - peeled,\r\n250g carrots - thinly sliced, \r\n1-2 red chillies - deseeded (optional – leave in if you like spicy food) and roughly chopped,\r\n300g ready-cooked or straight-to-wok egg noodles, \r\n250g pak choi - roughly chopped,\r\n4 spring onions - thinly sliced,\r\n1½ tbsp light soy sauce","category":"Pork","date":"2020-09-10 14:10:24.376614"}
{"_id":{"$oid":"5f5a34d33eb26d8688a6ebd0"},"recipe_name":"NEW POTATO SALAD FOR BARBECUE","difficulty_level":"Easy","prep_time":"25min","cooking_description":"1. Put the potatoes in a pan of cold salted water, bring to the boil, then simmer for 12 minutes or until tender.\r\n\r\n2. Drain, then cut any large potatoes in half. Heat a non-stick frying pan, add the nigella seeds and dry-fry for 30 seconds or so until they start to crackle. Remove from the heat.\r\n\r\n3. Put in a large bowl with the Greek yogurt and some seasoning. Mix in the warm potatoes, coating well, then toss through the radishes and most of the dill. Sprinkle over a little more chopped dill, then serve.","picture_url":"https://www.deliciousmagazine.co.uk/wp-content/uploads/2018/07/776932-1-eng-GB_new-potato-salad-768x760.jpg","ingrediants":"750g new potatoes,\r\n1 tbsp nigella seeds,\r\n200ml tub of Greek yogurt,\r\n150g radishes, thinly sliced,\r\ngood handful of fresh dill - chopped                                                              ","category":"Salad","date":"2020-09-10 14:14:43.069783"}
{"_id":{"$oid":"5f5a366a3eb26d8688a6ebd1"},"recipe_name":"LEFTOVER CHICKEN ENCHILADAS","difficulty_level":"Easy","prep_time":"45min","cooking_description":"1. For the enchilada sauce, add a little oil to a non-stick pot and gently fry the garlic.\r\n\r\n2.Add the chopped tomatoes, passata, sugar, and season with salt \u0026 pepper.\r\n\r\n3. Bring up to the boil and then reduce down to a simmer, cover with a lid and cook for 15 minutes, before blitzing with a stick blender, or in a food processor.\r\n4. Add a little oil to a non-stick frying pan and fry the onions for a few minutes before adding the cooked chicken.\r\n5. Add the fajita seasoning and stir through well before adding the kidney beans.\r\n6. Add around ½ of the blitzed tomato sauce and a little chopped coriander into the frying pan and stir everything together.\r\n7. In a large ovenproof dish, roll the chicken \u0026 kidney bean mix into the wraps, before covering with the rest of the sauce and a sprinkling of cheese.\r\n8. Bake in a preheated oven at 190C/170C fan for 20 minutes, or until the top is browned and serve with any leftover coriander.","picture_url":"https://lovefoodhatewaste.com/sites/default/files/styles/custom_large/public/Screenshot%202020-07-28%20at%2020.10.44.png?itok=F-srpFqS","ingrediants":"leftover roast chicken meat - chopped or shredded,\r\n1 pack tortilla wraps,\r\n1 tin red kidney beans,\r\n1 carton tomato passata,\r\n1 tin chopped tomatoes,\r\n1 packet fajita seasoning,\r\na little coriander - chopped,\r\n1 onion - sliced,\r\n50g Scottish extra mature cheddar - grated,\r\noil,\r\n1tbsp sugar,\r\nsalt \u0026 pepper","category":"Poultry","date":"2020-09-10 14:21:30.648037"}
